In [1]:
import pandas as pd
import numpy as np

### Series data structure in pandas

In [2]:
list1 = [10, 20, 30, 40, 50, 60]
list1

[10, 20, 30, 40, 50, 60]

In [3]:
s1 = pd.Series(list1, index = ["A", "B", "C", "D", "E", "F"])
s1

A    10
B    20
C    30
D    40
E    50
F    60
dtype: int64

In [4]:
arr1 = np.array([23, 45, 67, 86, 34])
arr2 = np.array([12, 34, 54, 32, 10])
arr1, arr2

(array([23, 45, 67, 86, 34]), array([12, 34, 54, 32, 10]))

In [5]:
sr11 = pd.Series(arr1)
sr22 = pd.Series(arr2)

In [6]:
sr11

0    23
1    45
2    67
3    86
4    34
dtype: int64

In [7]:
sr22

0    12
1    34
2    54
3    32
4    10
dtype: int64

In [8]:
sr11 + sr22

0     35
1     79
2    121
3    118
4     44
dtype: int64

### Dataframe for two dimension dataset

In [9]:
student_list = ["Student1", "Student2", "Student3", "Student4", "Student5"]
roll_no = ["002", "004", "005", "010", "020"]
marks = [56.76, 45.32, 80.67, 90.0, 56.2]

In [10]:
student_dict = {
    "Student Name": student_list,
    "Roll No": roll_no,
    "Marks Obtained": marks
}

In [11]:
student_dict

{'Student Name': ['Student1', 'Student2', 'Student3', 'Student4', 'Student5'],
 'Roll No': ['002', '004', '005', '010', '020'],
 'Marks Obtained': [56.76, 45.32, 80.67, 90.0, 56.2]}

In [12]:
student_df = pd.DataFrame(student_dict)

In [13]:
student_df

  Student Name Roll No  Marks Obtained
0     Student1     002           56.76
1     Student2     004           45.32
2     Student3     005           80.67
3     Student4     010           90.00
4     Student5     020           56.20

In [14]:
student_df.set_index("Roll No")

        Student Name  Marks Obtained
Roll No
002         Student1           56.76
004         Student2           45.32
005         Student3           80.67
010         Student4           90.00
020         Student5           56.20

In [15]:
student_df["Student Name"]

0    Student1
1    Student2
2    Student3
3    Student4
4    Student5
Name: Student Name, dtype: object

In [16]:
student_df["Marks Obtained"]

0    56.76
1    45.32
2    80.67
3    90.00
4    56.20
Name: Marks Obtained, dtype: float64

In [17]:
student_df[["Student Name", "Marks Obtained"]]

  Student Name  Marks Obtained
0     Student1           56.76
1     Student2           45.32
2     Student3           80.67
3     Student4           90.00
4     Student5           56.20

### Adding new column in the existing dataframe

student_df

In [18]:
student_df

  Student Name Roll No  Marks Obtained
0     Student1     002           56.76
1     Student2     004           45.32
2     Student3     005           80.67
3     Student4     010           90.00
4     Student5     020           56.20

In [19]:
student_df["Address"] = ["Brt", "ithari", "Dharan", "Duhabi", "Rangeli"]

In [20]:
student_df

  Student Name Roll No  Marks Obtained  Address
0     Student1     002           56.76      Brt
1     Student2     004           45.32   ithari
2     Student3     005           80.67   Dharan
3     Student4     010           90.00   Duhabi
4     Student5     020           56.20  Rangeli

In [21]:
df2 = pd.DataFrame({
    "A": np.arange(1, 11),
    "B": np.arange(11, 21)
})

In [22]:
df2

    A   B
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [23]:
df2["C"] = df2["A"] +df2["B"]

In [24]:
df2["C"]

0    12
1    14
2    16
3    18
4    20
5    22
6    24
7    26
8    28
9    30
Name: C, dtype: int64

In [25]:
df2["D"] = (df2["A"] + df2["B"] + df2["C"])/3

In [26]:
df2

    A   B   C          D
0   1  11  12   8.000000
1   2  12  14   9.333333
2   3  13  16  10.666667
3   4  14  18  12.000000
4   5  15  20  13.333333
5   6  16  22  14.666667
6   7  17  24  16.000000
7   8  18  26  17.333333
8   9  19  28  18.666667
9  10  20  30  20.000000

In [59]:
student_dict = {
    "Students": ["Student1", "Student2", "Student1", "Student4", "Student5", "Student6", "Student7", "Student8"],
    "Roll no": [1, np.nan, 1, 3, 4, 5, 6, 7],
    "Gender": ["Male", "Female", "Male", np.nan, "Male", "Female", "Female", "Male"],
    "Marks_obtained": [56, 76, 56, 43, 67, np.nan, 54, 75]

}

In [60]:
student_df = pd.DataFrame(student_dict)

In [61]:
student_df

   Students  Roll no  Gender  Marks_obtained
0  Student1      1.0    Male            56.0
1  Student2      NaN  Female            76.0
2  Student1      1.0    Male            56.0
3  Student4      3.0     NaN            43.0
4  Student5      4.0    Male            67.0
5  Student6      5.0  Female             NaN
6  Student7      6.0  Female            54.0
7  Student8      7.0    Male            75.0

### To check the duplicate value

In [62]:
student_df.duplicated().sum()

np.int64(1)

In [63]:
student_df = student_df.drop_duplicates()

In [64]:
student_df

   Students  Roll no  Gender  Marks_obtained
0  Student1      1.0    Male            56.0
1  Student2      NaN  Female            76.0
3  Student4      3.0     NaN            43.0
4  Student5      4.0    Male            67.0
5  Student6      5.0  Female             NaN
6  Student7      6.0  Female            54.0
7  Student8      7.0    Male            75.0

In [65]:
student_df.dropna()

   Students  Roll no  Gender  Marks_obtained
0  Student1      1.0    Male            56.0
4  Student5      4.0    Male            67.0
6  Student7      6.0  Female            54.0
7  Student8      7.0    Male            75.0

### Imputation method : (mean, median and mode)

In [66]:
gender_mode = student_df["Gender"].mode()[0]

In [67]:
gender_mode

'Female'

In [68]:
student_df["Gender"] = student_df["Gender"].fillna(gender_mode)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_17624\3713493536.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_df["Gender"] = student_df["Gender"].fillna(gender_mode)

In [69]:
student_df

   Students  Roll no  Gender  Marks_obtained
0  Student1      1.0    Male            56.0
1  Student2      NaN  Female            76.0
3  Student4      3.0  Female            43.0
4  Student5      4.0    Male            67.0
5  Student6      5.0  Female             NaN
6  Student7      6.0  Female            54.0
7  Student8      7.0    Male            75.0

In [70]:
marks_mean = student_df["Marks_obtained"].mean()

In [72]:
marks_mean = np.round(marks_mean, 2)
marks_mean

np.float64(61.83)

In [73]:
student_df["Marks_obtained"] = student_df["Marks_obtained"].fillna(marks_mean)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_17624\2908114070.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_df["Marks_obtained"] = student_df["Marks_obtained"].fillna(marks_mean)

In [74]:
student_df

   Students  Roll no  Gender  Marks_obtained
0  Student1      1.0    Male           56.00
1  Student2      NaN  Female           76.00
3  Student4      3.0  Female           43.00
4  Student5      4.0    Male           67.00
5  Student6      5.0  Female           61.83
6  Student7      6.0  Female           54.00
7  Student8      7.0    Male           75.00

In [75]:
student_df = student_df.dropna()

In [76]:
student_df

   Students  Roll no  Gender  Marks_obtained
0  Student1      1.0    Male           56.00
3  Student4      3.0  Female           43.00
4  Student5      4.0    Male           67.00
5  Student6      5.0  Female           61.83
6  Student7      6.0  Female           54.00
7  Student8      7.0    Male           75.00

In [77]:
student_df[["Roll no", "Marks_obtained"]]

   Roll no  Marks_obtained
0      1.0           56.00
3      3.0           43.00
4      4.0           67.00
5      5.0           61.83
6      6.0           54.00
7      7.0           75.00

In [78]:
student_df[["Students", "Gender"]]

   Students  Gender
0  Student1    Male
3  Student4  Female
4  Student5    Male
5  Student6  Female
6  Student7  Female
7  Student8    Male

In [79]:
student_df.columns

Index(['Students', 'Roll no', 'Gender', 'Marks_obtained'], dtype='object')

### Loading the datasets

In [80]:
df = pd.read_csv(r"C:\Users\lenovo\Downloads\Titanic-Dataset.csv")

In [81]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q